emacs/configuration.org
* Emacs Config
:PROPERTIES:
:results: silent
:END:

** Basic Setup
#+begin_src emacs-lisp
  (setq user-full-name "Olivier Lischer"
	user-mail-address "olivier.lischer@liolin.ch")

  (add-hook 'before-save-hook 'whitespace-cleanup)
#+end_src

** Archives
Add custom archives and installs use-package

#+BEGIN_SRC emacs-lisp
  (require 'package)

  (setq package-enable-at-startup nil)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
  (add-to-list 'package-archives '("org" . "https://orgmode.org/elpa/") t)
  (package-initialize)

  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (eval-when-compile
    (require 'use-package))
#+END_SRC


** Initial Settings
Disalbe the startup screen, disalbe backup files and auto-save files
#+BEGIN_SRC emacs-lisp
  (setq indent-tabs-mode nil)
  (setq inhibit-startup-screen t)
  (setq make-backup-files nil)
  (setq auto-save-default nil)
#+END_SRC

** Theme
Sets the theme for emacs
#+BEGIN_SRC emacs-lisp
  (setq visible-cursor nil)
  (tool-bar-mode -1)
  (menu-bar-mode -1)

  ;; check if the dracula theme installed. if not installed download and load it
  (if (equal (locate-file "atom-one-dark-theme.el" custom-theme-load-path '("" "c")) nil)
      (progn
	(package-refresh-contents)
	(package-install 'dracula-theme)))
  (load-theme 'atom-one-dark)

  (use-package smart-mode-line-powerline-theme
    :ensure t)

  (use-package smart-mode-line-atom-one-dark-theme
    :ensure t)

  (use-package smart-mode-line
    :ensure t
    :config
    (setq sml/theme 'atom-one-dark)
    (add-hook 'after-init-hook 'sml/setup))
#+END_SRC

** Paths
The path for source code
#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/src/")
#+END_SRC

Set up exec-path from shell and append ruby specific directory
#+begin_src emacs-lisp
  (defun set-exec-path-from-shell-PATH ()
    "Sets the exec-path to the same value used by the user shell"
    (interactive)
    (let ((path-from-shell
	   (replace-regexp-in-string
	    "[[:space:]\n]*$" ""
	    (shell-command-to-string "bash -l -c 'echo $PATH'"))))
      (setenv "PATH" path-from-shell)
      (setq exec-path (split-string path-from-shell path-separator))))

  ;; call function now
  (set-exec-path-from-shell-PATH)
#+end_src

** Spelling

Set hunspell for spell checking and as default language de_CH
#+BEGIN_SRC emacs-lisp
  (if (eq system-type 'darwin)
      (setq ispell-program-name "hunspell")
    (setq ispell-local-dictionary "de_CH")
    (setq ispell-local-dictionary-alist
	  '(("de_CH" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "de_CH") nil utf-8))))
#+END_SRC
** Modes

*** hl-mode
Highlight the current color
#+BEGIN_SRC emacs-lisp
  (global-hl-line-mode 1)
  ;;(set-face-background hl-line-face "#08510d")
#+END_SRC

*** dired

#+BEGIN_SRC emacs-lisp
  (use-package dired
    :init
    (setq dired-recursive-deletes 'always))
#+END_SRC
*** org-mode
**** Intsall org mode
#+BEGIN_SRC emacs-lisp
  (use-package org
    :ensure t
    :init)
#+END_SRC
**** View- & Design-Settings

clear headline view / hide the stars
#+BEGIN_SRC emacs-lisp
  (setq org-hide-leading-stars t)
#+END_SRC

set own drawers. NOTICE is an own drawer
#+BEGIN_SRC emacs-lisp
  (setq org-drawers
	(quote ("PROPERTIES" "CLOCK" "LOGBOOK" "RESULTS" "NOTICE")))

#+END_SRC
**** Tags
Exclude Tags from inheritance. Only the Start should have this TAGs
#+BEGIN_SRC emacs-lisp
  (setq org-tags-exclude-from-inheritance '("ATTACH"))
#+END_SRC
**** TODO-Org settings

Define TODO keywords
#+BEGIN_SRC emacs-lisp
  (setq org-todo-keywords
	'((sequence "TODO" "NEXT" "WAIT" "|" "DONE" "CANCELD")))
  (setq org-default-priority 67)
  (setq org-lowest-priority 69)
#+END_SRC

set done behouvier
#+BEGIN_SRC emacs-lisp
  (setq org-log-done
  (quote time))
#+END_SRC

Set org agenda file(s)
#+BEGIN_SRC emacs-lisp
  (if (eq system-type 'windows-nt)
      (setq org-agenda-files
	    '("Z:/Privat/Org/Agenda/GTD.org"
	      "Z:/Privat/Org/Agenda/Events.org"))
    (setq org-agenda-files
	  '("~/Nextcloud/Org/Agenda/GTD.org"
	    "~/Nextcloud/Org/Agenda/Events.org")))
#+END_SRC

Agenda Settings
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-skip-scheduled-if-done t)
  (setq org-agenda-skip-deadline-if-done t)
  (setq org-agenda-skip-scheduled-if-deadline-is-shown t)
  (setq org-agenda-skip-timestamp-if-done t)
#+END_SRC

Agenda View
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-custom-commands
	'(("p" tags-todo "+project&+TODO=\"NEXT\"")
	  ("t" tags-todo "task")
	  ("c" "Agenda and Home-related tasks"
	   ((tags-todo "daily")
	    (tags-todo "monthly")
	    (tags-todo "+task")
	    (tags-todo "+TODO=\"NEXT\"")
	    (agenda "")))))
#+END_SRC

**** Literal programming

enable syntax highlighting in org files
#+BEGIN_SRC emacs-lisp
  (setq org-src-fontify-natively t)
#+END_SRC

Enable source evaluation without confim and loads the languages
#+BEGIN_SRC emacs-lisp
  (setq org-confirm-babel-evaluate nil)
  (org-babel-do-load-languages
   'org-babel-load-languages
     '((emacs-lisp . t)
      (org . t)
      (python . t)
      (shell . t)
      (sql . t)
      (ledger . t)))
#+END_SRC

**** ox-reveal

config for ox-reval
#+BEGIN_SRC emacs-lisp
  (use-package ox-reveal
    :ensure t
    :config
    (load-library "ox-reveal"))
#+END_SRC

**** Mobile Org

Sets the Mobile Org Server directory.
#+BEGIN_SRC emacs-lisp
  (setq org-mobile-directory "~/Nextcloud/MobileOrg")
  (setq org-directory "~/Nextcloud/Org")
  (setq org-mobile-inbox-for-pull "~/Nextcloud/Org/flagged.org")
#+END_SRC

**** org-structure-template
#+begin_src emacs-lisp
  (setq org-structure-template-alist
	'(("n" . "notes")
	  ("a" . "export ascii")
	  ("c" . "center")
	  ("C" . "comment")
	  ("e" . "example")
	  ("E" . "export")
	  ("h" . "export html")
	  ("l" . "export latex")
	  ("q" . "quote")
	  ("s" . "src")
	  ("v" . "verse")))
#+end_src
**** org-capture
#+begin_src emacs-lisp
  (setq org-default-notes-file (concat org-directory "/capture.org"))

  (setq org-capture-templates
	'(("t" "Todo" entry (file+headline org-default-notes-file "Tasks")
	   "* TODO %?\n  %i\n  %a")))
#+end_src


*** deft
#+BEGIN_SRC emacs-lisp
  (use-package deft
    :ensure t
    :init
    (if (eq system-type 'windows-nt)
	(setq deft-directory "Z:/Privat/Org/deft")
      (setq deft-directory "~/Nextcloud/Org/deft"))
    (setq deft-extensions '("org"))
    (setq deft-default-extension "org")
    (setq deft-text-mode 'org-mode)
    (setq deft-use-filename-as-title t)
    (setq deft-use-filter-string-for-filename t)
    (setq deft-auto-save-interval 0)
    :config
    (global-set-key (kbd "C-c d") 'deft))
#+END_SRC
*** ido-mode

Enable ido-mode
#+BEGIN_SRC emacs-lisp
  (use-package ido
    :ensure t
    :init
    (ido-mode t))
#+END_SRC

*** flycheck

Enable fly-checking
#+BEGIN_SRC emacs-lisp
  (use-package flycheck
    :ensure t
    :config
    (defun my-flycheck ()
      (interactive)
      (flycheck-mode 1)
      (flycheck-list-errors))
    (setq flycheck-clang-args "-std=c++17"))
#+END_SRC

*** hide-show

set key-bindeing
#+BEGIN_SRC emacs-lisp
  (defun my-hs ()
    (local-set-key (kbd "C-c <right>") 'hs-show-block)
    (local-set-key (kbd "C-c <left>")  'hs-hide-block)
    (local-set-key (kbd "C-c <up>")    'hs-hide-all)
    (local-set-key (kbd "C-c <down>")  'hs-show-all)
    (hs-minor-mode t))
#+END_SRC

*** linums-mode

enable line numbers
#+BEGIN_SRC emacs-lisp
  (defun my-linum ()
    (linum-mode t))
#+END_SRC

*** semantic-mode
#+BEGIN_SRC emacs-lisp
  (use-package semantic
    :ensure t)
  ;; :init
  ;; (semantic-mode 1)
  ;; (defun my:add-semantic-to-autocompletion()
  ;;   (add-to-list 'ac-sources 'ac-source-semantic))
  ;; (add-hook 'c-mode-common-hook 'my:add-semantic-to-autocompletion)
  ;; (global-semantic-idle-scheduler-mode 1))
#+END_SRC

*** ace-window
#+BEGIN_SRC emacs-lisp
  (use-package ace-window
    :ensure t
    :bind (("C-x o" . ace-window)))
#+END_SRC
*** web-mode
#+BEGIN_SRC emacs-lisp
  (use-package web-mode
    :ensure t
    :config
    (add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.html\\'" . web-mode)))
#+END_SRC
*** helm-mode
#+BEGIN_SRC emacs-lisp
  (use-package helm
    :ensure t
    :bind (("C-c h" . helm-command-prefix)
	   ("C-x b" . helm-buffers-list)
	   ("C-x r b" . helm-bookmarks)
	   ("C-x C-f" . helm-find-files)
	   ("M-x" . helm-M-x)
	   ("M-y" . helm-show-kill-ring)
	   :map helm-map
	   ([tab] . helm-execute-persistent-action)))
#+END_SRC
*** irony-mode
Installs irony and starts in C/C++ buffers.
#+BEGIN_SRC emacs-lisp
  (use-package irony
    :ensure t
    :init
    (defun liolin/irony-mode-on ()
      (when (member major-mode irony-supported-major-modes)
	(irony-mode 1)))

    (add-hook 'c++-mode-hook 'liolin/irony-mode-on)
    (add-hook 'c-mode-hook 'liolin/irony-mode-on)
    (add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options))
#+END_SRC

