emacs/configuration.org
*** company-mode
#+BEGIN_SRC emacs-lisp
  (use-package company
    :ensure t
    :config
    (setq company-idle-delay 0)
    :init
    (add-hook 'after-init-hook 'global-company-mode))
#+END_SRC

*** show-paren-mode
#+BEGIN_SRC emacs-lisp
  (use-package paren
    :ensure t
    :init
    (setq show-paren-delay 0)
    :config
    (show-paren-mode 1))
#+END_SRC
*** ledger-mode
#+BEGIN_SRC emacs-lisp
  (use-package ledger-mode
    :ensure t
    :init
    (setq ledger-clear-whole-transactions 1)
    (setq ledger-reports
	  '(("budget" "hledger -f %(ledger-file) bal -MB -b %(tagvalue) --budget cur:CHF expenses income")
	    ("bal" "%(binary) -f %(ledger-file) bal")
	    ("reg" "%(binary) -f %(ledger-file) reg")
	    ("payee" "%(binary) -f %(ledger-file) reg @%(payee)")
	    ("account" "%(binary) -f %(ledger-file) reg %(account)")))
    :mode ("\\.dat\\'"
	   "\\.hledger\\'"
	   "\\.journal\\'"))
#+END_SRC

*** php-mode
#+BEGIN_SRC emacs-lisp
  (use-package php-mode
    :ensure t)
#+END_SRC

*** web-mode
#+BEGIN_SRC emacs-lisp
  (use-package web-mode
    :ensure t)
#+END_SRC
*** c-mode
#+BEGIN_SRC emacs-lisp
  (setq c-default-style "bsd"
	c-basic-offset 4)
#+END_SRC
*** c++-mode
#+BEGIN_SRC emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))
#+END_SRC
*** auto-complete-mode
#+BEGIN_SRC emacs-lisp
  ;; (use-package auto-complete
  ;;              :ensure t
  ;;              :config
  ;;              (ac-config-default))
#+END_SRC
*** ac-php
#+BEGIN_SRC emacs-lisp
  (use-package ac-php
    :ensure t)
#+END_SRC
*** yasnippet
Enable yasnippet globaly
#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
    :ensure t
    :init (yas-global-mode 1))
#+END_SRC

Install php snippets
#+BEGIN_SRC emacs-lisp
  (use-package php-auto-yasnippets
    :ensure t)
#+END_SRC

*** iedit
Enable iedit, bind to C-c ;
iedit makes posible to edit the same variabel at the same time
#+BEGIN_SRC emacs-lisp
  (use-package iedit
    :ensure t
    :init (define-key global-map (kbd "C-c ;") 'iedit-mode))
#+END_SRC
*** smartparens
#+BEGIN_SRC emacs-lisp
  (use-package smartparens
    :ensure t
    :init (smartparens-global-mode 1))

  (defun liolin/sp/open-block-c-mode (id action context)
    (when (eq action 'insert)
      (backward-char)
      (newline)
      (indent-according-to-mode)
      (forward-char)
      (newline)
      (newline)
      (indent-according-to-mode)
      (previous-line)
      (indent-according-to-mode)))

  (defun liolin/sp/open-block-php-mode (id action context)
    (when (eq action 'insert)
      (backward-char)
      (newline)
      (indent-according-to-mode)
      (forward-char)
      (newline)
      (newline)
      (indent-according-to-mode)
      (previous-line)
      (indent-according-to-mode)))

  (sp-local-pair 'c++-mode "{" nil :post-handlers '(:add liolin/sp/open-bloc-c-mode))
  (sp-local-pair 'c-mode "{" nil :post-handlers '(:add liolin/sp/open-bloc-c-mode))
#+END_SRC

*** expand-region
#+BEGIN_SRC emacs-lisp
  (use-package expand-region
    :ensure t
    :bind ("M-m" . er/expand-region))
#+END_SRC

*** projectile

enable projectile with helm
#+BEGIN_SRC emacs-lisp
  (use-package projectile
    :ensure
    :bind (:map projectile-mode-map ("C-c p" . projectile-command-map))
    :init (add-hook 'c-mode-hook 'projectile-mode)
    (add-hook 'php-mode-hook 'projectile-mode)
    (setq projectile-completion-system 'helm)
    :config (helm-projectile-on))
#+END_SRC

*** EasyPG
#+BEGIN_SRC emacs-lisp
  (require 'epa-file)
  (if (eq system-type 'darwin)
      (custom-set-variables '(epg-gpg-program "/usr/local/bin/gpg")))
  (epa-file-enable)
#+END_SRC
*** helm-etgas-plus
#+BEGIN_SRC emacs-lisp
  (use-package helm-etags-plus
    :ensure t
    :config
    (global-set-key "\M-." 'helm-etags-plus-select))
#+END_SRC

*** other packages
#+BEGIN_SRC emacs-lisp
  (use-package helm-flycheck
    :ensure t)

  (use-package helm-projectile
    :ensure t)

  (use-package htmlize
    :ensure t)

  (use-package company-php
    :ensure t)

  ;; (use-package company-irony
  ;;   :ensure t)

  (use-package magit
    :ensure t)

  (use-package phpunit
    :ensure t)

  (use-package helm-phpunit
    :ensure t)

  (use-package fixmee
    :ensure t)

#+END_SRC

** Windows size keybinding

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "S-<left>") 'shrink-window-horizontally)
  (global-set-key (kbd "S-<right>") 'enlarge-window-horizontally)
  (global-set-key (kbd "S-<down>") 'shrink-window)
  (global-set-key (kbd "S-<up>") 'enlarge-window)
#+END_SRC

** Some keybindings
Open the current file in the default browser
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c C-x b") 'browse-url-of-file)
#+END_SRC

Bind org-agenda for faster access to ageda view
#+BEGIN_SRC emacs-lisp
  (define-key global-map "\C-ca" 'org-agenda)
#+END_SRC
** Programming
*** Tag file
#+BEGIN_SRC emacs-lisp
  (if (eq system-type 'darwin)
      (setq path-to-ctags "/usr/local/ctags/bin/ctags")
    (setq path-to-ctags "c:/bin/ctags/ctags.exe"))

  (defun create-tags (dir-name)
    "Create tags file."
    (interactive "DDirectory: ")
    (shell-command
     (format "%s -f TAGS -e -R --exclude='.ac-php-conf.json' --exclude='*.html' --exclude='*.css' --exclude='*.tpl' %s" path-to-ctags (directory-file-name dir-name))))

  (global-set-key (kbd "M-*") 'pop-tag-mark)
#+END_SRC

*** C/C++ Programming

my C/C++ programming setup
#+BEGIN_SRC emacs-lisp
  (defun my-c-hook ()
    (my-hs)
    (my-linum)
    (my-flycheck))

  (add-hook 'c-mode-common-hook 'my-c-hook)
#+END_SRC

*** Python Programming
#+BEGIN_SRC emacs-lisp
  (defun my-python-hook ()
    (my-hs)
    (my-linum)
    (my-flycheck))

  (add-hook 'python-mode-hook 'my-python-hook)
#+END_SRC
*** Web Programming

Setting php mode up
#+BEGIN_SRC emacs-lisp
  (defun liolin/php-mode-hook ()
    (my-hs)
    (my-linum)
    (my-flycheck)

    ;; auto completion
    (require 'ac-php)
    (require 'company-php)
    (company-mode t)
    (make-local-variable 'company-backends)
    (add-to-list 'company-backends 'company-ac-php-backend)
    (yas-global-mode 1)

    ;; if file not exists load from github
    (if (not (file-exists-p "~/.emacs.d/src/php-doc.el"))
	(url-copy-file "https://gist.githubusercontent.com/stesie/6564885/raw/f79cd412034a65ac95a7a25c27b1fadb5486f585/php-doc.el" "~/.emacs.d/src/php-doc.el"))
    (require 'php-doc)

    (ac-php-core-eldoc-setup ) ;; enable eldoc
    (define-key php-mode-map  (kbd "C-]") 'ac-php-find-symbol-at-point)   ;goto define
    (define-key php-mode-map  (kbd "C-t") 'ac-php-location-stack-back)    ;go back

    (setq indent-tabs-mode nil)
    (setq c-basic-offset 4)
    (setq php-template-compatibility nil)
    (subword-mode 1))

  (add-hook 'php-mode-hook 'liolin/php-mode-hook)
  (add-hook 'php-mode-hook (lambda()
			     (add-hook 'after-save-hook 'ac-php-remake-tags nil 'nonNil)))

#+END_SRC

#+BEGIN_SRC emacs-lisp
  (defun my-web-mode-hook ()
    (local-set-key '[backtab] 'indent-relative)
    (setq indent-tabs-mode 1)
    (setq web-mode-markup-indent-offset 2
	  web-mode-css-indent-offset 2
	  web-mode-code-indent-offset 2))

  (add-hook 'web-mode-hook 'my-web-mode-hook)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (defun liolin/js-mode-hook ()
    (my-hs)
    (my-linum)

    ;; (auto-complete-mode t)
    (company-mode t)
    (yas-global-mode 1)

    (setq indent-tabs-mode 1)
    (setq c-basic-offset 4))

  (add-hook 'js-mode-hook 'liolin/js-mode-hook)
#+END_SRC

*** Rust
Rust mode and autocompletion
#+BEGIN_SRC emacs-lisp
  (defun liolin/rust-hook ()
    (add-hook 'flycheck-mode-hook #'flycheck-rust-setup)
    (my-hs)
    (my-linum)
    (my-flycheck))

  (add-hook 'rust-mode-hook #'racer-mode)
  (add-hook 'rust-mode-hook #'liolin/rust-hook)
  (add-hook 'rust-mode-hook #'projectile-mode)
  (add-hook 'rust-mode-hook #'fixmee-mode)
  (add-hook 'racer-mode-hook #'eldoc-mode)
  (add-hook 'racer-mode-hook #'company-mode)

  (require 'rust-mode)
  (define-key rust-mode-map (kbd "TAB") #'company-indent-or-complete-common)
  (setq company-tooltip-align-annotations t)
  (setq racer-rust-src-path "~/.multirust/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/src")
#+END_SRC
*** Ruby

#+begin_src emacs-lisp
  (add-hook 'ruby-mode-hook 'robe-mode)
  (push 'company-robe company-backends)
#+end_src
** My functions

Duplicates line
#+BEGIN_SRC emacs-lisp
  (defun duplicate-line()
    (interactive)
    (move-beginning-of-line 1)
    (kill-line)
    (yank)
    (open-line 1)
    (next-line 1)
    (yank)
    )
  (global-set-key (kbd "C-.") 'duplicate-line)
#+END_SRC

Compiles projekt from subdirectory
#+BEGIN_SRC emacs-lisp
  (defun desperately-compile ()
    "Traveling up the path, find a Makefile and `compile'."
    (interactive)
    (when (locate-dominating-file default-directory "Makefile")
      (with-temp-buffer
	(cd (locate-dominating-file default-directory "Makefile"))
	(compile "make -k"))))
#+END_SRC
** Reveal Workarround
#+BEGIN_SRC emacs-lisp
  (defun ox-reveal-workaround ()
    (interactive)
    (require 'org)
    (let ((current-prefix-arg 1))
      (call-interactively 'org-reload)))
#+END_SRC

