emacs/configuration.el
  (setq company-idle-delay 0)
  :init
  (add-hook 'after-init-hook 'global-company-mode))

(use-package paren
  :ensure t
  :init
  (setq show-paren-delay 0)
  :config
  (show-paren-mode 1))

(use-package ledger-mode
  :ensure t
  :init
  (setq ledger-clear-whole-transactions 1)
  (setq ledger-reports
	'(("budget" "hledger -f %(ledger-file) bal -MB -b %(tagvalue) --budget cur:CHF expenses income")
	  ("bal" "%(binary) -f %(ledger-file) bal")
	  ("reg" "%(binary) -f %(ledger-file) reg")
	  ("payee" "%(binary) -f %(ledger-file) reg @%(payee)")
	  ("account" "%(binary) -f %(ledger-file) reg %(account)")))
  :mode ("\\.dat\\'"
	 "\\.hledger\\'"
	 "\\.journal\\'"))

(use-package php-mode
  :ensure t)

(use-package web-mode
  :ensure t)

(setq c-default-style "bsd"
      c-basic-offset 4)

(add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))

;; (use-package auto-complete
;;              :ensure t
;;              :config
;;              (ac-config-default))

(use-package ac-php
  :ensure t)

(use-package yasnippet
  :ensure t
  :init (yas-global-mode 1))

(use-package php-auto-yasnippets
  :ensure t)

(use-package iedit
  :ensure t
  :init (define-key global-map (kbd "C-c ;") 'iedit-mode))

(use-package smartparens
  :ensure t
  :init (smartparens-global-mode 1))

(defun liolin/sp/open-block-c-mode (id action context)
  (when (eq action 'insert)
    (backward-char)
    (newline)
    (indent-according-to-mode)
    (forward-char)
    (newline)
    (newline)
    (indent-according-to-mode)
    (previous-line)
    (indent-according-to-mode)))

(defun liolin/sp/open-block-php-mode (id action context)
  (when (eq action 'insert)
    (backward-char)
    (newline)
    (indent-according-to-mode)
    (forward-char)
    (newline)
    (newline)
    (indent-according-to-mode)
    (previous-line)
    (indent-according-to-mode)))

(sp-local-pair 'c++-mode "{" nil :post-handlers '(:add liolin/sp/open-bloc-c-mode))
(sp-local-pair 'c-mode "{" nil :post-handlers '(:add liolin/sp/open-bloc-c-mode))

(use-package expand-region
  :ensure t
  :bind ("M-m" . er/expand-region))

(use-package projectile
  :ensure
  :bind (:map projectile-mode-map ("C-c p" . projectile-command-map))
  :init (add-hook 'c-mode-hook 'projectile-mode)
  (add-hook 'php-mode-hook 'projectile-mode)
  (setq projectile-completion-system 'helm)
  :config (helm-projectile-on))

(require 'epa-file)
(if (eq system-type 'darwin)
    (custom-set-variables '(epg-gpg-program "/usr/local/bin/gpg")))
(epa-file-enable)

(use-package helm-etags-plus
  :ensure t
  :config
  (global-set-key "\M-." 'helm-etags-plus-select))

(use-package helm-flycheck
  :ensure t)

(use-package helm-projectile
  :ensure t)

(use-package htmlize
  :ensure t)

(use-package company-php
  :ensure t)

;; (use-package company-irony
;;   :ensure t)

(use-package magit
  :ensure t)

(use-package phpunit
  :ensure t)

(use-package helm-phpunit
  :ensure t)

(use-package fixmee
  :ensure t)

(global-set-key (kbd "S-<left>") 'shrink-window-horizontally)
(global-set-key (kbd "S-<right>") 'enlarge-window-horizontally)
(global-set-key (kbd "S-<down>") 'shrink-window)
(global-set-key (kbd "S-<up>") 'enlarge-window)

(global-set-key (kbd "C-c C-x b") 'browse-url-of-file)

(define-key global-map "\C-ca" 'org-agenda)

(if (eq system-type 'darwin)
    (setq path-to-ctags "/usr/local/ctags/bin/ctags")
  (setq path-to-ctags "c:/bin/ctags/ctags.exe"))

(defun create-tags (dir-name)
  "Create tags file."
  (interactive "DDirectory: ")
  (shell-command
   (format "%s -f TAGS -e -R --exclude='.ac-php-conf.json' --exclude='*.html' --exclude='*.css' --exclude='*.tpl' %s" path-to-ctags (directory-file-name dir-name))))

(global-set-key (kbd "M-*") 'pop-tag-mark)

(defun my-c-hook ()
  (my-hs)
  (my-linum)
  (my-flycheck))

(add-hook 'c-mode-common-hook 'my-c-hook)

(defun my-python-hook ()
  (my-hs)
  (my-linum)
  (my-flycheck))

(add-hook 'python-mode-hook 'my-python-hook)

(defun liolin/php-mode-hook ()
  (my-hs)
  (my-linum)
  (my-flycheck)

  ;; auto completion
  (require 'ac-php)
  (require 'company-php)
  (company-mode t)
  (make-local-variable 'company-backends)
  (add-to-list 'company-backends 'company-ac-php-backend)
  (yas-global-mode 1)

  ;; if file not exists load from github
  (if (not (file-exists-p "~/.emacs.d/src/php-doc.el"))
      (url-copy-file "https://gist.githubusercontent.com/stesie/6564885/raw/f79cd412034a65ac95a7a25c27b1fadb5486f585/php-doc.el" "~/.emacs.d/src/php-doc.el"))
  (require 'php-doc)

  (ac-php-core-eldoc-setup ) ;; enable eldoc
  (define-key php-mode-map  (kbd "C-]") 'ac-php-find-symbol-at-point)   ;goto define
  (define-key php-mode-map  (kbd "C-t") 'ac-php-location-stack-back)    ;go back

  (setq indent-tabs-mode nil)
  (setq c-basic-offset 4)
  (setq php-template-compatibility nil)
  (subword-mode 1))

(add-hook 'php-mode-hook 'liolin/php-mode-hook)
(add-hook 'php-mode-hook (lambda()
			   (add-hook 'after-save-hook 'ac-php-remake-tags nil 'nonNil)))

(defun my-web-mode-hook ()
  (local-set-key '[backtab] 'indent-relative)
  (setq indent-tabs-mode 1)
  (setq web-mode-markup-indent-offset 2
	web-mode-css-indent-offset 2
	web-mode-code-indent-offset 2))

(add-hook 'web-mode-hook 'my-web-mode-hook)

(defun liolin/js-mode-hook ()
  (my-hs)
  (my-linum)

  ;; (auto-complete-mode t)
  (company-mode t)
  (yas-global-mode 1)

  (setq indent-tabs-mode 1)
  (setq c-basic-offset 4))

(add-hook 'js-mode-hook 'liolin/js-mode-hook)

(defun liolin/rust-hook ()
  (add-hook 'flycheck-mode-hook #'flycheck-rust-setup)
  (my-hs)
  (my-linum)
  (my-flycheck))

(add-hook 'rust-mode-hook #'racer-mode)
(add-hook 'rust-mode-hook #'liolin/rust-hook)
(add-hook 'rust-mode-hook #'projectile-mode)
(add-hook 'rust-mode-hook #'fixmee-mode)
(add-hook 'racer-mode-hook #'eldoc-mode)
(add-hook 'racer-mode-hook #'company-mode)

(require 'rust-mode)
(define-key rust-mode-map (kbd "TAB") #'company-indent-or-complete-common)
(setq company-tooltip-align-annotations t)
(setq racer-rust-src-path "~/.multirust/toolchains/stable-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/src")

(add-hook 'ruby-mode-hook 'robe-mode)
(push 'company-robe company-backends)

(defun duplicate-line()
  (interactive)
  (move-beginning-of-line 1)
  (kill-line)
  (yank)
  (open-line 1)
  (next-line 1)
  (yank)
  )
(global-set-key (kbd "C-.") 'duplicate-line)

(defun desperately-compile ()
  "Traveling up the path, find a Makefile and `compile'."
  (interactive)
  (when (locate-dominating-file default-directory "Makefile")
    (with-temp-buffer
      (cd (locate-dominating-file default-directory "Makefile"))
      (compile "make -k"))))

(defun ox-reveal-workaround ()
  (interactive)
  (require 'org)
  (let ((current-prefix-arg 1))
    (call-interactively 'org-reload)))

(org-mobile-pull)
