emacs/configuration.org
** Startup Screen
Synchroniese with org mobile and open the caputre file from org mobile.
As last open the TODO list for the current day.
#+BEGIN_SRC emacs-lisp
  (org-mobile-pull)
  (find-file "~/Nextcloud/Org/flagged.org")
  (org-agenda nil "c")
#+END_SRC
** Emacs Server
#+begin_src emacs-lisp
  (server-start)
#+end_src
