emacs/configuration.el
(find-file "~/Nextcloud/Org/flagged.org")
(org-agenda nil "c")

(server-start)
